

 CREATE      view  [dbo].[VBoursEmirat_Denormal]    as with cte as (  select b.Name, b.FullName , Gheymat [شاخص], YearDarsad [درصد تغییر نسبت با سال گذشته],bh.[شاخص بورس امارات   ۲۰۰۵ ] [شاخص بورس ۲۰۰۵ ],cast(cast((b.Gheymat - bh.[شاخص بورس امارات   ۲۰۰۵ ]) /bh.[شاخص بورس امارات   ۲۰۰۵ ] as decimal(10,4)) * 100 as decimal(10,2)) [درصد تغییر نسبت به سال 2005],null as [رتبه بندی شرکت],[فعالیت شرکت ], [معرفی شرکت], bh.[سال ورود ] [سال ورود ]   ,nba.[رشد نسبت به سال 2005] [رشد نرخ برابری ارز نسبت به سال 2005]
 from BoursEmirat b  
 join BoursEmiratHistorical bh on b.Name = bh.Name  
 left join NerkheBarabariHistory na on na.Name like N'%امارات%'
 left join vNerkheBarabari nba on nba.PName like N'%'+dbo.RetreiveVahed(substring(na.pname,1,3))+'%'
 where not exists(select 1 from [dbo].BoursEmirat b2 where b.Name = b2.Name and b2.createdate > b.createdate) )  select [Name], FullName, [شاخص], [درصد تغییر نسبت با سال گذشته], [شاخص بورس ۲۰۰۵ ], [درصد تغییر نسبت به سال 2005]
 
 ,
	  [رشد نرخ برابری ارز نسبت به سال 2005]
,
cast([درصد تغییر نسبت به سال 2005] * ([رشد نرخ برابری ارز نسبت به سال 2005]/100  + 1 ) as decimal(10,2))
[رشد شاخص بورس نسبت به سال 2005 با تعدیل برابری نرخ ارز],

cast([درصد تغییر نسبت به سال 2005] * ([رشد نرخ برابری ارز نسبت به سال 2005]/100 + 1 ) 
 * 0.64 as decimal(10,2)) [رشد شاخص بورس نسبت به سال 2005 با تعدیل برابری نرخ ارز و کسر تورم],  
 
 case   when [درصد تغییر نسبت به سال 2005] > 1000 Then N'Grade A, توصیه به سیو ۳۰ درصد سود, پیشنهاد به ایرانیان برای فعالیت در بخش تولید, بازرگانی و خدمات این نوع کسب و کار در قالب شرکتهای فوق العاده کوچک که محصول خود را به شرکتهای بزرگ میفروشد'   when [درصد تغییر نسبت به سال 2005] > 500 and [درصد تغییر نسبت به سال 2005] <= 1000 Then N'Grade B, توصیه به سیو ۳۰ درصد سود, پیشنهاد به ایرانیان برای فعالیت در بخش تولید, بازرگانی و خدمات این نوع کسب و کار در قالب شرکتهای فوق العاده کوچک که محصول خود را به شرکتهای بزرگ میفروشد'   when [درصد تغییر نسبت به سال 2005] > 247 and [درصد تغییر نسبت به سال 2005] <= 500 Then N'Grade C, توصیه به سیو ۳۰ درصد سود, پیشنهاد به ایرانیان برای فعالیت در بخش تولید, بازرگانی و خدمات این نوع کسب و کار در قالب شرکتهای فوق العاده کوچک که محصول خود را به شرکتهای بزرگ میفروشد'   when [درصد تغییر نسبت به سال 2005] <= 247 Then case     when [فعالیت شرکت ] in (select [فعالیت شرکت ] from cte where [درصد تغییر نسبت به سال 2005] > 247 ) then N'Grade D+, دارای مزیت نسبی, فاقد مزیت رقابتی, ناموفق, پیشنهاد فروش سهم'  when [فعالیت شرکت ] not in (select [فعالیت شرکت ] from cte where [درصد تغییر نسبت به سال 2005] > 247 ) then N'Grade D-, پیشنهاد به ایرانیان برای عدم فعالیت در این نوع کسب و کار در بخش تولید, بازرگانی و خدمات, توصیه سیو صد در صد سود در بورس'  end   end [رتبه بندی شرکت],     [فعالیت شرکت ], [معرفی شرکت],N'('+cast([سال ورود ] as nvarchar(200))+N')' [سال ورود ]from cte  
    
