create view HistoricalViewChartayi
as
select 
Id
, instrumentId
, [ارزش دیروز بازار]/10000000000 [ارزش دیروز بازار]
, symbolFA
, [1DaysVolume]/10000000000 [1DaysVolume]
, [day]
, [3DaysVolume]/10000000000 [3DaysVolume]
, [7DaysVolume]/10000000000 [7DaysVolume]
, [14DaysVolume]/10000000000 [14DaysVolume]
, [30DaysVolume]/10000000000 [30DaysVolume]
, [180DaysVolume]/10000000000 [180DaysVolume]
, [dayMarketCap]
, [ارزش بازار]/10000000000 [ارزش بازار]
, [رشد]
, float
, [ارزش سی روز گذشته بازار]/10000000000 [ارزش سی روز گذشته بازار]
, [رشد سی روزه]
, [ارزش سه روز گذشته بازار]/10000000000 [ارزش سه روز گذشته بازار]
, [رشد سه روزه]
, [ارزش هفت روز گذشته بازار]/10000000000 [ارزش هفت روز گذشته بازار]
, [رشد هفت روزه]
, [ارزش چهارده روز گذشته بازار]/10000000000 [ارزش چهارده روز گذشته بازار]
, [رشد چهارده روزه]
, [فروش حقیقی]/10000000000 [فروش حقیقی]
, [خرید حقیقی]/10000000000 [خرید حقیقی]
, [فروش حقوقی]/10000000000 [فروش حقوقی]
, [خرید حقوقی]/10000000000 [خرید حقوقی]
, [فروش حقیقی چهارده روز]/10000000000 [فروش حقیقی چهارده روز]
, [خرید حقیقی چهارده روز]/10000000000 [خرید حقیقی چهارده روز]
, [فروش حقوقی چهارده روز]/10000000000 [فروش حقوقی چهارده روز]
, [خرید حقوقی چهارده روز]/10000000000 [خرید حقوقی چهارده روز]
, [فروش حقیقی نود روز]/10000000000 [فروش حقیقی نود روز]
, [خرید حقیقی نود روز]/10000000000 [خرید حقیقی نود روز]
, [فروش حقوقی نود روز]/10000000000 [فروش حقوقی نود روز]
, [خرید حقوقی نود روز]/10000000000 [خرید حقوقی نود روز]
, [خرید حقوقی سه روز]/10000000000 [خرید حقوقی سه روز]
, [خرید حقوقی هفت روز]/10000000000 [خرید حقوقی هفت روز]
, [خرید حقیقی سه روز]/10000000000 [خرید حقیقی سه روز]
, [خرید حقیقی هفت روز]/10000000000 [خرید حقیقی هفت روز]
, [فروش حقوقی سه روز]/10000000000 [فروش حقوقی سه روز]
, [فروش حقیقی سه روز]/10000000000 [فروش حقیقی سه روز]
, [فروش حقوقی هفت روز]/10000000000 [فروش حقوقی هفت روز]
, [فروش حقیقی هفت روز]/10000000000 [فروش حقیقی هفت روز]
, [خرید حقوقی سی روز]/10000000000 [خرید حقوقی سی روز]
, [خرید حقیقی سی روز]/10000000000 [خرید حقیقی سی روز]
, [فروش حقوقی سی روز]/10000000000 [فروش حقوقی سی روز]
, [فروش حقیقی سی روز]/10000000000 [فروش حقیقی سی روز]
, [90DaysVolume]/10000000000 [90DaysVolume]
, [رشد نود روزه]
, [رشد شش ماهه]
, CreateDate
, ['رشد یک ساله']
, ['365DaysVolume']/10000000000 ['365DaysVolume']
, ['خرید حقیقی یک سال']/10000000000 ['خرید حقیقی یک سال']
, ['خرید حقوقی یک سال']/10000000000 ['خرید حقوقی یک سال']
, ['فروش حقیقی یک سال']/10000000000 ['فروش حقیقی یک سال']
, ['فروش حقوقی یک سال']/10000000000 ['فروش حقوقی یک سال']
, FinalPrice
, ['رشد شش مرداد 99']
, ['فروش حقوقی 6 مرداد 99']/10000000000 ['فروش حقوقی 6 مرداد 99']
, ['خرید حقوقی 6 مرداد 99']/10000000000 ['خرید حقوقی 6 مرداد 99']
, ['فروش حقیقی 6 مرداد 99']/10000000000 ['فروش حقیقی 6 مرداد 99']
, ['خرید حقیقی 6 مرداد 99']/10000000000 ['خرید حقیقی 6 مرداد 99']
, ['6Mordad99DaysVolume']/10000000000 ['6Mordad99DaysVolume']
from HistoricalChartayi hc
