CREATE   Procedure [dbo].[GetBalanceSheetTalfighi](@Date date = null)
as
begin
	if	@date is null
		set @Date = cast(getdate() as date)
	select distinct instrumentId,symbolFA,day,[سال مالی],[ماه مالی],[روز آخر دوره],[روز آخر سال مالی],[تاریخ انتشار],['درآمدهای عملیاتی'],['موجودی نقد'],['سرمایه گذاری کوتاه مدت'],['سایر حسابها و اسناد دریافتنی'],['موجودی مواد و کالا'],['پیش پرداخت ها'],['دارایی های نگهداری شده برای فروش'],['جمع داراییهای جاری'],['سرمایه گذاریهای بلند مدت'],['داراییهای ثابت مشهود'],['حسابها و اسناد دریافتنی تجاری بلند مدت'],['سایر دارایی ها'],['جمع داراییهای غیرجاری'],['جمع داراییها'],['پیش دریافتها'],['ذخیره مالیات بر درامد'],['سود سهام پیشنهادی و پرداختنی'],['حصه جاری تسهیلات مالی دریافتی'],['جمع بدهیهای جاری'],['حسابها و اسناد پرداختنی بلند مدت'],['تسهیلات مالی دریافتی بلند مدت'],['دریافتنی‌های تجاری و سایر دریافتنی‌ها'],['پرداختنی‌های تجاری و سایر پرداختنی‌ها'],['سرمایه گذاری در املاک'],['ذخایر'],['سود (زیان) قبل از کسر مالیات']
,['سپرده قانونی'],['اندوخته صرف سهام']
	from BalanceSheet hc
	where not exists(select 1 from BalanceSheet h where hc.instrumentId = h.instrumentId and h.CreateDate > hc.CreateDate)and 
	(cast(CreateDate as date) =  cast(@DATE as date) or day = convert(varchar, @DATE, 112))
	order by 1 desc
end