



--drop view [VPreBalanceSheetTalfighi]
--select * from VPreBalanceSheetTalfighi
CREATE view [dbo].[VPreBalanceSheetTalfighi]
	as

--select * from ctesumTalfighiFaraBourse
select * from [VPreBalanceSheetTalfighi_FaraBourse_new] 
	union all 
	select p1.* ,
[نسبت پیش دریافت به فروش],
[درصد شرکت انرژی محور چند درصد از کل سود خالص],
[درصد معادن چند درصد از کل سود خالص],
[ارزش بازار],
[نسبت سود تقسیمی به سود تعدیل شده یک ساله],
[نسبت بدهی هر شرکت به بانک به کل بدهی شرکت ها به بانک],
[چهار سپرده],
[نسبت سود تقسیمی به سود تعدیل شده یکساله],
[طلب از بازار به فروش],
[درصد هر بانک از چهارسپرده],
[بدهی به بانک و بازار],
[درصد بدهی هر بانک به سایر بانک ها],
[بدهی به بانکها],
[درصد بدهی هر شرکت به بانک از کل شرکت ها],
[درصد هر شرکت از کل سود پیشنهادی و پرداختی],
[نسبت دارایی جاری به فروش تعدیل شده یکساله],
[نسبت بدهی به بانک به فروش],
[ارزش بازار چند برابر خالص دارایی جاری],
[سود خالص به خالص دارایی جاری],
['سهم گروه از سود شرکت های وابسته و مشارکت های خاص'],
['سپرده های مشتریان'],
['جمع بدهیها و حقوق صاحبان سهام'],
['جمع بدهیهای جاری و غیر جاری'],
['جمع حقوق صاحبان سهام'],
['ذخیره مزایای پایان خدمت'],
['ذخایر و سایر بدهی ها'],
['سود (زیان) عملیات در حال تداوم قبل از مالیات'],
['سود (زیان) پایه هر سهم ناشی از عملیات در حال تداوم - عملیاتی'],
['سود (زیان) پایه هر سهم ناشی از عملیات در حال تداوم'],
['بدهی بابت بیمه عمر و مدیریت سرمایه'],
['مطالبات از بیمه گران و بیمه‌گران اتکایی'],
['مطالبات از بیمه‌گذاران و نمایندگان'],
['سهم بیمه گران اتکایی از ذخایر فنی'],
['بدهی به بیمه‌گذاران و نمایندگان'],
['بدهی به بیمه‌گران و بیمه‌گران اتکایی'],
['ذخیره خسارت معوق '],
['سایر ذخایر فنی'],
['ذخیره ریسک‌های منقضی نشده'],
['سود (زیان) خالص'],
['داراییهای نامشهود'],
['هزینه‌های مالی'],
['خالص سایر درآمدها و هزینه‌های غیرعملیاتی'],
['سایر درآمدهای عملیاتی'],
['سایر هزینه‌های عملیاتی'],
['سهم گروه از سود شرکت‌های وابسته و مشارکت‌های خاص'],
['هزینه مالیات بر درآمد سال جاری'],
['هزینه استهلاک'],
['هزینه های عمومی, اداری و تشکیلاتی'],
['هزینه های تولید'],
['هزینه سهم مشارکت در منافع'],
['سود (زیان) ناخالص فعالیتهای بیمه ای'],
['هزینه کاهش ارزش دریافتنی‌‏ها (هزینه استثنایی)'],
['هزینه تامین منابع مالی عملیات لیزینگ'],
['سایر هزینه های بیمه ای'],
['هزینه مالیات بر درآمد سال‌های قبل'],
['سایر درآمدها و هزینه‌های غیرعملیاتی - اقلام متفرقه'],
['هزینه ارائه خدمات'],
['درآمدهای عملیاتی'],
['بهای تمام ‌شده درآمدهای عملیاتی'],
['سود (زیان) عملیاتی'],

p2.['سود (زیان) ناخالص']


	from dbo.fn_VPreBalanceSheetTalfighi_Bourse_part1_temp p1
	join dbo.fn_VPreBalanceSheetTalfighi_Bourse_part2_temp p2 on p1.InstrumentId = p2.InstrumentId and p1.day = p2.day

