CREATE view [dbo].[VPreBalanceSheetGheyreTalfighi]
		as 
		select [InstrumentId], [symbolFA], [day], [سال مالی], [ماه مالی], [روز آخر دوره], [روز آخر سال مالی], [تاریخ انتشار], ['فروش'], ['بهای تمام شده کالای فروش رفته'], ['سود (زیان) خالص عملیات در حال تداوم قبل از مالیات'], ['موجودی نقد'], ['سرمایه گذاری کوتاه مدت'], ['سایر حسابها و اسناد دریافتنی'], ['موجودی مواد و کالا'], ['پیش پرداخت ها'], ['دارایی های نگهداری شده برای فروش'], ['جمع داراییهای جاری'], ['سرمایه گذاریهای بلند مدت'], ['داراییهای ثابت مشهود'], ['حسابها و اسناد دریافتنی تجاری بلند مدت'], ['سایر دارایی ها'], ['جمع داراییهای غیرجاری'], ['ج'مع داراییها], ['پیش دریافتها'], ['ذخیره مالیات بر درامد'], ['سود سهام پیشنهادی و پرداختنی'], ['حصه جاری تسهیلات مالی دریافتی'], ['جمع بدهیهای جاری'], ['حسابها و اسناد پرداختنی بلند مدت'], ['تسهیلات مالی دریافتی بلند مدت'], ['سود (زیان) انباشته'], ['دریافتنی‌های تجاری و سایر دریافتنی‌ها'], ['پرداختنی‌های تجاری و سایر پرداختنی‌ها'], ['سرمایه گذاری در املاک'], ['ذخایر'], ['مطالبات از سایر بانکها و موسسات اعتباری'], ['مطالبات از بانک مرکزی'], ['سپرده های دیداری'], ['سپرده های قرض الحسنه و پس اندار و مشابه'], ['بدهی به بانک مرکزی'], ['سایر سپرده ها'], ['بدهی به بانکها و موسسات اعتباری'], ['مطالبات از دولت'], ['تسهیلات اعطایی و مطالبات از اشخاص دولتی'], ['تسهیلات اعطایی به سایر اشخاص'], ['سپرده های سرمایه گذاری مدت دار'], ['حسابها و اسناد دریافتنی تجاری'], ['حسابها و اسناد پرداختنی تجاری'], ['سایر حسابها و اسناد پرداختنی'], ['سپرده قانونی'], ['اندوخته صرف سهام'], ['پیش پرداخت های سرمایه ای'], ['بدهی‌های مرتبط با دارایی‌های غیر جاری نگهداری شده برای فروش'], [CreateDate], [سود خالص تعدیل شده یک ساله], [فروش تعدیل شده یک ساله], [بهای تمام شده تعدیل شده یک ساله], [نسبت بدهی جاری به دارایی جاری], [خالص داریی جاری], ['سرمایه گذاری در اوراق بهادار'], ['سایر دریافتنی‌ها و پیش‌پرداخت‌ها'], ['سایر سرمایه گذاری ها'], ['تسهیلات اعطایی به اشخاص'], ['سرمایه‌گذاری‌ در اوراق بهادار وسپرده های بانکی'], [نسبت بدهی به فروش], [نسبت سود به فروش], [بهای تمام شده کالا به فروش], [بدهی به بازار], [نسبت موجودی مواد و کالا به فروش], [درصد سود هر شرکت از کل سود شرکت ها], [سهم هر شرکت از کل دارایی ثابت شرکت ها], [نسبت فروش هر شرکت از کل فروش شرکت ها], [سهم هر شرکت از کل وجوه نقد و موجودی نزد بانک ها], [درصد سود خالص هر شرکت از کل سود خالص شرکت ها], [درصد فروش هر شرکت از کل فروش شرکت ها], [درصد خالص دارایی هر شرکت از کل دارایی شرکت ها], [GroupName], [فروش چند برابر خالص دارایی جاریست], [نسبت فروش به ارزش بازار], [سود خالص به ارزش بازار], [دوران بازگشت سرمایه], [نسبت بدهی به فروش تعدیل شده یک ساله], [سهم هر شرکت از کل هر سرمایه گذاری و سایر دارایی], [نسبت موجودی مواد و کالا به بدهی], [نسبت دارایی جاری به فروش], [خالص دارایی جاری به فروش], [نسبت پیش دریافت به فروش], [درصد شرکت انرژی محور چند درصد از کل سود خالص], [درصد معادن چند درصد از کل سود خالص], [ارزش بازار], [نسبت سود تقسیمی به سود تعدیل شده یک ساله], [نسبت بدهی هر شرکت به بانک به کل بدهی شرکت ها به بانک], [چهار سپرده], [نسبت سود تقسیمی به سود تعدیل شده یکساله], [طلب از بازار به فروش], [درصد هر بانک از چهارسپرده], [بدهی به بانک و بازار], [درصد بدهی هر بانک به سایر بانک ها], [بدهی به بانکها], [درصد بدهی هر شرکت به بانک از کل شرکت ها], [درصد هر شرکت از کل سود پیشنهادی و پرداختی], [نسبت دارایی جاری به فروش تعدیل شده یکساله], [نسبت بدهی به بانک به فروش], [ارزش بازار چند برابر خالص دارایی جاری], [سود خالص به خالص دارایی جاری]
		,null ['سهم گروه از سود شرکت های وابسته و مشارکت های خاص']
		,['سپرده های مشتریان'], ['جمع بدهیها و حقوق صاحبان سهام'],['جمع بدهیهای جاری و غیر جاری'] 
		, ['جمع حقوق صاحبان سهام']
		, ['ذخیره مزایای پایان خدمت']
		, ['ذخایر و سایر بدهی ها']
		, ['سود (زیان) عملیات در حال تداوم قبل از مالیات']
		, ['سود (زیان) پایه هر سهم ناشی از عملیات در حال تداوم - عملیاتی']
		, ['سود (زیان) پایه هر سهم ناشی از عملیات در حال تداوم']
		, ['بدهی بابت بیمه عمر و مدیریت سرمایه']
		, ['مطالبات از بیمه گران و بیمه‌گران اتکایی']
		, ['مطالبات از بیمه‌گذاران و نمایندگان']
		, ['سهم بیمه گران اتکایی از ذخایر فنی']
		, ['بدهی به بیمه‌گذاران و نمایندگان']
		, ['بدهی به بیمه‌گران و بیمه‌گران اتکایی']
		, ['ذخیره خسارت معوق ']
		, ['سایر ذخایر فنی']
		, ['ذخیره ریسک‌های منقضی نشده']
		, ['سود (زیان) خالص']
		, ['داراییهای نامشهود']
		, ['هزینه‌های مالی']
		, ['خالص سایر درآمدها و هزینه‌های غیرعملیاتی']
		, ['سایر درآمدهای عملیاتی']
		, ['سایر هزینه‌های عملیاتی']
		, ['سهم گروه از سود شرکت‌های وابسته و مشارکت‌های خاص'] 
, ['هزینه مالیات بر درآمد سال جاری']
, ['هزینه استهلاک']
, ['هزینه های عمومی, اداری و تشکیلاتی']
, ['هزینه های تولید']
, ['هزینه سهم مشارکت در منافع']
, ['سود (زیان) ناخالص فعالیتهای بیمه ای']
, ['هزینه کاهش ارزش دریافتنی‌‏ها (هزینه استثنایی)']
, ['هزینه تامین منابع مالی عملیات لیزینگ']
, ['سایر هزینه های بیمه ای']
, ['هزینه مالیات بر درآمد سال‌های قبل']
, ['سایر درآمدها و هزینه‌های غیرعملیاتی - اقلام متفرقه']
, ['هزینه ارائه خدمات']
, ['درآمدهای عملیاتی']
, ['بهای تمام ‌شده درآمدهای عملیاتی']
, ['سود (زیان) عملیاتی']
from VPreBalanceSheetGheyreTalfighi_FaraBourse
		union all select [InstrumentId], [symbolFA], [day], [سال مالی], [ماه مالی], [روز آخر دوره], [روز آخر سال مالی], [تاریخ انتشار], ['فروش'], ['بهای تمام شده کالای فروش رفته'], ['سود (زیان) خالص عملیات در حال تداوم قبل از مالیات'], ['موجودی نقد'], ['سرمایه گذاری کوتاه مدت'], ['سایر حسابها و اسناد دریافتنی'], ['موجودی مواد و کالا'], ['پیش پرداخت ها'], ['دارایی های نگهداری شده برای فروش'], ['جمع داراییهای جاری'], ['سرمایه گذاریهای بلند مدت'], ['داراییهای ثابت مشهود'], ['حسابها و اسناد دریافتنی تجاری بلند مدت'], ['سایر دارایی ها'], ['جمع داراییهای غیرجاری'], ['ج'مع داراییها], ['پیش دریافتها'], ['ذخیره مالیات بر درامد'], ['سود سهام پیشنهادی و پرداختنی'], ['حصه جاری تسهیلات مالی دریافتی'], ['جمع بدهیهای جاری'], ['حسابها و اسناد پرداختنی بلند مدت'], ['تسهیلات مالی دریافتی بلند مدت'], ['سود (زیان) انباشته'], ['دریافتنی‌های تجاری و سایر دریافتنی‌ها'], ['پرداختنی‌های تجاری و سایر پرداختنی‌ها'], ['سرمایه گذاری در املاک'], ['ذخایر'], ['مطالبات از سایر بانکها و موسسات اعتباری'], ['مطالبات از بانک مرکزی'], ['سپرده های دیداری'], ['سپرده های قرض الحسنه و پس اندار و مشابه'], ['بدهی به بانک مرکزی'], ['سایر سپرده ها'], ['بدهی به بانکها و موسسات اعتباری'], ['مطالبات از دولت'], ['تسهیلات اعطایی و مطالبات از اشخاص دولتی'], ['تسهیلات اعطایی به سایر اشخاص'], ['سپرده های سرمایه گذاری مدت دار'], ['حسابها و اسناد دریافتنی تجاری'], ['حسابها و اسناد پرداختنی تجاری'], ['سایر حسابها و اسناد پرداختنی'], ['سپرده قانونی'], ['اندوخته صرف سهام'], ['پیش پرداخت های سرمایه ای'], ['بدهی‌های مرتبط با دارایی‌های غیر جاری نگهداری شده برای فروش'], [CreateDate], [سود خالص تعدیل شده یک ساله], [فروش تعدیل شده یک ساله], [بهای تمام شده تعدیل شده یک ساله], [نسبت بدهی جاری به دارایی جاری], [خالص داریی جاری], ['سرمایه گذاری در اوراق بهادار'], ['سایر دریافتنی‌ها و پیش‌پرداخت‌ها'], ['سایر سرمایه گذاری ها'], ['تسهیلات اعطایی به اشخاص'], ['سرمایه‌گذاری‌ در اوراق بهادار وسپرده های بانکی'], [نسبت بدهی به فروش], [نسبت سود به فروش], [بهای تمام شده کالا به فروش], [بدهی به بازار], [نسبت موجودی مواد و کالا به فروش], [درصد سود هر شرکت از کل سود شرکت ها], [سهم هر شرکت از کل دارایی ثابت شرکت ها], [نسبت فروش هر شرکت از کل فروش شرکت ها], [سهم هر شرکت از کل وجوه نقد و موجودی نزد بانک ها], [درصد سود خالص هر شرکت از کل سود خالص شرکت ها], [درصد فروش هر شرکت از کل فروش شرکت ها], [درصد خالص دارایی هر شرکت از کل دارایی شرکت ها], [GroupName], [فروش چند برابر خالص دارایی جاریست], [نسبت فروش به ارزش بازار], [سود خالص به ارزش بازار], [دوران بازگشت سرمایه], [نسبت بدهی به فروش تعدیل شده یک ساله], [سهم هر شرکت از کل هر سرمایه گذاری و سایر دارایی], [نسبت موجودی مواد و کالا به بدهی], [نسبت دارایی جاری به فروش], [خالص دارایی جاری به فروش], [نسبت پیش دریافت به فروش], [درصد شرکت انرژی محور چند درصد از کل سود خالص], [درصد معادن چند درصد از کل سود خالص], [ارزش بازار], [نسبت سود تقسیمی به سود تعدیل شده یک ساله], [نسبت بدهی هر شرکت به بانک به کل بدهی شرکت ها به بانک], [چهار سپرده], [نسبت سود تقسیمی به سود تعدیل شده یکساله], [طلب از بازار به فروش], [درصد هر بانک از چهارسپرده], [بدهی به بانک و بازار], [درصد بدهی هر بانک به سایر بانک ها], [بدهی به بانکها], [درصد بدهی هر شرکت به بانک از کل شرکت ها], [درصد هر شرکت از کل سود پیشنهادی و پرداختی], [نسبت دارایی جاری به فروش تعدیل شده یکساله], [نسبت بدهی به بانک به فروش], [ارزش بازار چند برابر خالص دارایی جاری], [سود خالص به خالص دارایی جاری]
		,null ['سهم گروه از سود شرکت های وابسته و مشارکت های خاص']
		,['سپرده های مشتریان'], ['جمع بدهیها و حقوق صاحبان سهام'],['جمع بدهیهای جاری و غیر جاری']
		, ['جمع حقوق صاحبان سهام']
		, ['ذخیره مزایای پایان خدمت']
		, ['ذخایر و سایر بدهی ها']
		, ['سود (زیان) عملیات در حال تداوم قبل از مالیات']
		, ['سود (زیان) پایه هر سهم ناشی از عملیات در حال تداوم - عملیاتی']
		, ['سود (زیان) پایه هر سهم ناشی از عملیات در حال تداوم']
		, ['بدهی بابت بیمه عمر و مدیریت سرمایه']
		, ['مطالبات از بیمه گران و بیمه‌گران اتکایی']
		, ['مطالبات از بیمه‌گذاران و نمایندگان']
		, ['سهم بیمه گران اتکایی از ذخایر فنی']
		, ['بدهی به بیمه‌گذاران و نمایندگان']
		, ['بدهی به بیمه‌گران و بیمه‌گران اتکایی']
		, ['ذخیره خسارت معوق ']
		, ['سایر ذخایر فنی']
		, ['ذخیره ریسک‌های منقضی نشده']
		, ['سود (زیان) خالص']
		, ['داراییهای نامشهود']
		, ['هزینه‌های مالی']
		, ['خالص سایر درآمدها و هزینه‌های غیرعملیاتی']
		, ['سایر درآمدهای عملیاتی']
		, ['سایر هزینه‌های عملیاتی']
		, ['سهم گروه از سود شرکت‌های وابسته و مشارکت‌های خاص'] 
, ['هزینه مالیات بر درآمد سال جاری']
, ['هزینه استهلاک']
, ['هزینه های عمومی, اداری و تشکیلاتی']
, ['هزینه های تولید']
, ['هزینه سهم مشارکت در منافع']
, ['سود (زیان) ناخالص فعالیتهای بیمه ای']
, ['هزینه کاهش ارزش دریافتنی‌‏ها (هزینه استثنایی)']
, ['هزینه تامین منابع مالی عملیات لیزینگ']
, ['سایر هزینه های بیمه ای']
, ['هزینه مالیات بر درآمد سال‌های قبل']
, ['سایر درآمدها و هزینه‌های غیرعملیاتی - اقلام متفرقه']
, ['هزینه ارائه خدمات']
, ['درآمدهای عملیاتی']
, ['بهای تمام ‌شده درآمدهای عملیاتی']
, ['سود (زیان) عملیاتی']
		from VPreBalanceSheetGheyreTalfighi_Bourse
