




--select * from VPreBalanceSheetTalfighi
CREATE view [dbo].[VPreBalanceSheetTalfighi]
	as
	with ctesumFaraBourse as (select 
cast( 	sum([سود خالص تعدیل شده یک ساله]) as decimal(20,10))+0.00000001 [سود خالص تعدیل شده یک ساله],
cast( sum(['داراییهای ثابت مشهود'])as decimal(20,10))+0.00000001 ['داراییهای ثابت مشهود'] , 
cast( sum([فروش تعدیل شده یک ساله])as decimal(20,10))+0.00000001 [فروش تعدیل شده یک ساله], 
cast( sum(['موجودی نقد'])as decimal(20,10))+0.00000001 ['موجودی نقد'], 
cast( sum(['سرمایه گذاری در املاک'])as decimal(20,10))+0.00000001 ['سرمایه گذاری در املاک'] , 
cast( sum(['سرمایه گذاری کوتاه مدت'])as decimal(20,10))+0.00000001 ['سرمایه گذاری کوتاه مدت'], 
cast( sum(['سرمایه گذاریهای بلند مدت'])as decimal(20,10))+0.00000001 ['سرمایه گذاریهای بلند مدت'], 
cast( sum([خالص داریی جاری])as decimal(20,10)) +0.00000001[خالص داریی جاری], 
cast( sum(['تسهیلات مالی دریافتی بلند مدت']) as decimal(20,10))+0.00000001['تسهیلات مالی دریافتی بلند مدت'],  
cast( sum(['حصه جاری تسهیلات مالی دریافتی']) as decimal(20,10))+0.00000001['حصه جاری تسهیلات مالی دریافتی'], 
cast( sum(['سایر سپرده ها']) as decimal(20,10))+0.00000001['سایر سپرده ها'], 
cast( SUM(['سپرده های سرمایه گذاری مدت دار'])as decimal(20,10)) +0.00000001['سپرده های سرمایه گذاری مدت دار'] , 
cast( sum(['سپرده های قرض الحسنه و پس اندار و مشابه'])as decimal(20,10))+0.00000001 ['سپرده های قرض الحسنه و پس اندار و مشابه'] , 
cast( sum(['سپرده های دیداری']) as decimal(20,10))+0.00000001['سپرده های دیداری'], 
cast( sum(['سود سهام پیشنهادی و پرداختنی']) as decimal(20,10))+0.00000001['سود سهام پیشنهادی و پرداختنی'],
cast(sum(['بدهی به بانکها و موسسات اعتباری']) as decimal(20,10))+0.00000001['بدهی به بانکها و موسسات اعتباری']
from VPreBalanceSheetTalfighi_FaraBourse),
ctesumBourse as (select 
cast(sum([سود خالص تعدیل شده یک ساله])as decimal(20,10))+0.00000001 [سود خالص تعدیل شده یک ساله],
cast(sum(['داراییهای ثابت مشهود'])as decimal(20,10))+0.00000001 ['داراییهای ثابت مشهود'] , 
cast(sum([فروش تعدیل شده یک ساله])as decimal(20,10))+0.00000001 [فروش تعدیل شده یک ساله], 
cast(sum(['موجودی نقد'])as decimal(20,10))+0.00000001 ['موجودی نقد'], 
cast(sum(['سرمایه گذاری در املاک'])as decimal(20,10))+0.00000001 ['سرمایه گذاری در املاک'] , 
cast(sum(['سرمایه گذاری کوتاه مدت'])as decimal(20,10))+0.00000001 ['سرمایه گذاری کوتاه مدت'], 
cast(sum(['سرمایه گذاریهای بلند مدت'])as decimal(20,10))+0.00000001 ['سرمایه گذاریهای بلند مدت'], 
cast(sum([خالص داریی جاری])as decimal(20,10)) +0.00000001[خالص داریی جاری], 
cast(sum(['تسهیلات مالی دریافتی بلند مدت']) as decimal(20,10))+0.00000001['تسهیلات مالی دریافتی بلند مدت'],  
cast(sum(['حصه جاری تسهیلات مالی دریافتی']) as decimal(20,10))+0.00000001['حصه جاری تسهیلات مالی دریافتی'], 
cast(sum(['سایر سپرده ها']) as decimal(20,10))+0.00000001  ['سایر سپرده ها'], 
cast(SUM(['سپرده های سرمایه گذاری مدت دار'])as decimal(20,10)) +0.00000001  ['سپرده های سرمایه گذاری مدت دار'] , 
cast(sum(['سپرده های قرض الحسنه و پس اندار و مشابه']) as decimal(20,10))+0.00000001['سپرده های قرض الحسنه و پس اندار و مشابه'] , 
cast(sum(['سپرده های دیداری'])as decimal(20,10)) +0.00000001  ['سپرده های دیداری'], 
cast(sum(['سود سهام پیشنهادی و پرداختنی']) as decimal(20,10))+0.00000001['سود سهام پیشنهادی و پرداختنی'],
cast(sum(['بدهی به بانکها و موسسات اعتباری']) as decimal(20,10))+0.00000001['بدهی به بانکها و موسسات اعتباری']
from VPreBalanceSheetTalfighi_Bourse)
--select * from ctesumfaraBourse
	select [InstrumentId], [symbolFA], [day], [سال مالی], [ماه مالی], [روز آخر دوره], [روز آخر سال مالی], [تاریخ انتشار], ['فروش'], ['بهای تمام شده کالای فروش رفته'], ['سود (زیان) خالص عملیات در حال تداوم قبل از مالیات'], ['موجودی نقد'], ['سرمایه گذاری کوتاه مدت'], ['سایر حسابها و اسناد دریافتنی'], ['موجودی مواد و کالا'], ['پیش پرداخت ها'], ['دارایی های نگهداری شده برای فروش'], ['جمع داراییهای جاری'], ['سرمایه گذاریهای بلند مدت'], ['داراییهای ثابت مشهود'], ['حسابها و اسناد دریافتنی تجاری بلند مدت'], ['سایر دارایی ها'], ['جمع داراییهای غیرجاری'], ['جمع داراییها'], ['پیش دریافتها'], ['ذخیره مالیات بر درامد'], ['سود سهام پیشنهادی و پرداختنی'], ['حصه جاری تسهیلات مالی دریافتی'], ['جمع بدهیهای جاری'], ['حسابها و اسناد پرداختنی بلند مدت'], ['تسهیلات مالی دریافتی بلند مدت'], ['سود (زیان) انباشته'], ['دریافتنی‌های تجاری و سایر دریافتنی‌ها'], ['پرداختنی‌های تجاری و سایر پرداختنی‌ها'], ['سرمایه گذاری در املاک'], ['ذخایر'], ['مطالبات از سایر بانکها و موسسات اعتباری'], ['مطالبات از بانک مرکزی'], ['سپرده های دیداری'], ['سپرده های قرض الحسنه و پس اندار و مشابه'], ['بدهی به بانک مرکزی'], ['سایر سپرده ها'], ['بدهی به بانکها و موسسات اعتباری'], ['مطالبات از دولت'], ['تسهیلات اعطایی و مطالبات از اشخاص دولتی'], ['تسهیلات اعطایی به سایر اشخاص'], ['سپرده های سرمایه گذاری مدت دار'], ['حسابها و اسناد دریافتنی تجاری'], ['حسابها و اسناد پرداختنی تجاری'], ['سایر حسابها و اسناد پرداختنی'], ['سپرده قانونی'], ['اندوخته صرف سهام'], ['پیش پرداخت های سرمایه ای'], ['بدهی‌های مرتبط با دارایی‌های غیر جاری نگهداری شده برای فروش'], [CreateDate], [سود خالص تعدیل شده یک ساله], [فروش تعدیل شده یک ساله], [بهای تمام شده تعدیل شده یک ساله], [نسبت بدهی جاری به دارایی جاری], [خالص داریی جاری], ['سرمایه گذاری در اوراق بهادار'], ['سایر دریافتنی‌ها و پیش‌پرداخت‌ها'], ['سایر سرمایه گذاری ها'], ['تسهیلات اعطایی به اشخاص'], ['سرمایه‌گذاری‌ در اوراق بهادار وسپرده های بانکی'], 
	case when [فروش تعدیل شده یک ساله] != 0 then cast(( ['جمع بدهیهای جاری'] /([فروش تعدیل شده یک ساله])) as decimal(30,2)) else 0 end  [نسبت بدهی به فروش],
	case when [فروش تعدیل شده یک ساله] != 0 then cast([سود خالص تعدیل شده یک ساله] / ([فروش تعدیل شده یک ساله]) as decimal(30,10))else 0 end[نسبت سود به فروش],
	--در تلفیقی قیمت تمام شده کالا در هیچکدام از اطلاعات بورس داده نمیشود بنابر این تمام آیتم های مربوط به قیمت کالا صفر میشود
	cast (case when [فروش تعدیل شده یک ساله] = 0 then 0 else  [بهای تمام شده تعدیل شده یک ساله] / [فروش تعدیل شده یک ساله] end as decimal(30,2)) [بهای تمام شده کالا به فروش], 
	[بدهی به بازار],
	cast(case when [فروش تعدیل شده یک ساله] = 0 then 0 else ['موجودی مواد و کالا'] / [فروش تعدیل شده یک ساله] end as decimal(30,2)) 
	[نسبت موجودی مواد و کالا به فروش],
	[سود خالص تعدیل شده یک ساله] / (select ctesumFaraBourse.[سود خالص تعدیل شده یک ساله] from ctesumFaraBourse) [درصد سود هر شرکت از کل سود شرکت ها],
	cast(['داراییهای ثابت مشهود'] / (select ctesumFaraBourse.['داراییهای ثابت مشهود'] from ctesumFaraBourse)as decimal(30,7)) [سهم هر شرکت از کل دارایی ثابت شرکت ها],
	cast([فروش تعدیل شده یک ساله] / (select ctesumFaraBourse.[فروش تعدیل شده یک ساله] from ctesumFaraBourse)as decimal(30,7)) [نسبت فروش هر شرکت از کل فروش شرکت ها],
	cast(['موجودی نقد'] / (select ctesumFaraBourse.['موجودی نقد'] from ctesumFaraBourse)as decimal(30,7)) [سهم هر شرکت از کل وجوه نقد و موجودی نزد بانک ها],

	cast([سود خالص تعدیل شده یک ساله]/ (select [سود خالص تعدیل شده یک ساله] from ctesumFaraBourse)as decimal(30,7)) [درصد سود خالص هر شرکت از کل سود خالص شرکت ها],
cast([فروش تعدیل شده یک ساله]/ (select [فروش تعدیل شده یک ساله] from ctesumFaraBourse)as decimal(30,7)) [درصد فروش هر شرکت از کل فروش شرکت ها],
cast([خالص داریی جاری]/ (select [خالص داریی جاری] from ctesumFaraBourse)as decimal(30,7)) [درصد خالص دارایی هر شرکت از کل دارایی شرکت ها],
	[GroupName],
	cast(case when [خالص داریی جاری] != 0 then [فروش تعدیل شده یک ساله]/[خالص داریی جاری] else 0 end as decimal(30,12)) [فروش چند برابر خالص دارایی جاریست],

	cast(case when [ارزش بازار] != 0 then [فروش تعدیل شده یک ساله] / [ارزش بازار] else 0 end as decimal(30,12)) [نسبت فروش به ارزش بازار],
cast(case when [ارزش بازار] != 0 then [سود خالص تعدیل شده یک ساله] / [ارزش بازار] else 0 end as decimal(30,4)) [سود خالص به ارزش بازار],

	cast(case when [سود خالص تعدیل شده یک ساله]!= 0 then [ارزش بازار]  / [سود خالص تعدیل شده یک ساله] else 0 end as decimal(30,0)) [دوران بازگشت سرمایه],
cast(case when [فروش تعدیل شده یک ساله] != 0 then ['جمع بدهیهای جاری']/[فروش تعدیل شده یک ساله] else 0 end as decimal(30,5))[نسبت بدهی به فروش تعدیل شده یک ساله],

	cast((['سرمایه گذاری در املاک'] + ['سرمایه گذاری کوتاه مدت'] + ['سرمایه گذاریهای بلند مدت'])/(select (['سرمایه گذاری در املاک'] + ['سرمایه گذاری کوتاه مدت'] + ['سرمایه گذاریهای بلند مدت']) from ctesumFaraBourse) as decimal(30,7))
[سهم هر شرکت از کل هر سرمایه گذاری و سایر دارایی],
 cast(case when ['جمع بدهیهای جاری'] != 0 then ['موجودی مواد و کالا']/['جمع بدهیهای جاری'] else 0 end as decimal(30,6))[نسبت موجودی مواد و کالا به بدهی],
	
	cast(case when [فروش تعدیل شده یک ساله] != 0 then ['جمع داراییهای جاری']/[فروش تعدیل شده یک ساله] else 0 end as decimal(30,6)) [نسبت دارایی جاری به فروش]
  ,cast(case when [فروش تعدیل شده یک ساله] != 0 then [خالص داریی جاری]/[فروش تعدیل شده یک ساله] else 0 end as decimal(30,6)) [خالص دارایی جاری به فروش]
  ,
  (case when [فروش تعدیل شده یک ساله] != 0 then ['پیش دریافتها']/[فروش تعدیل شده یک ساله] else 0 end ) [نسبت پیش دریافت به فروش]
,
case when GroupName = N'صنایع انرژی محور' then [سود خالص تعدیل شده یک ساله]/(select [سود خالص تعدیل شده یک ساله] from ctesumFaraBourse) else 0 end [درصد شرکت انرژی محور چند درصد از کل سود خالص], 


case when GroupName = N'معادن' then [سود خالص تعدیل شده یک ساله]/(select [سود خالص تعدیل شده یک ساله] from ctesumFaraBourse) else 0 end [درصد معادن چند درصد از کل سود خالص],
[ارزش بازار]
,case when [سود خالص تعدیل شده یک ساله] != 0 then ['سود سهام پیشنهادی و پرداختنی']/[سود خالص تعدیل شده یک ساله] else 0 end [نسبت سود تقسیمی به سود تعدیل شده یک ساله]
 
, (['تسهیلات مالی دریافتی بلند مدت'] + ['حصه جاری تسهیلات مالی دریافتی'])/(select ['تسهیلات مالی دریافتی بلند مدت'] + ['حصه جاری تسهیلات مالی دریافتی'] from ctesumFaraBourse)	 [نسبت بدهی هر شرکت به بانک به کل بدهی شرکت ها به بانک]
,
['سایر سپرده ها'] + ['سپرده های سرمایه گذاری مدت دار'] + ['سپرده های قرض الحسنه و پس اندار و مشابه'] + ['سپرده های دیداری']
[چهار سپرده],
 CASE WHEN [سود خالص تعدیل شده یک ساله] != 0 THEN ['سود سهام پیشنهادی و پرداختنی']/ [سود خالص تعدیل شده یک ساله]
 ELSE 0 END
[نسبت سود تقسیمی به سود تعدیل شده یکساله],
CASE WHEN [فروش تعدیل شده یک ساله] != 0 THEN ['دریافتنی‌های تجاری و سایر دریافتنی‌ها']/[فروش تعدیل شده یک ساله]
ELSE 0 END 
[طلب از بازار به فروش],

case when GroupName = N'بانک' then( ['سایر سپرده ها'] + ['سپرده های سرمایه گذاری مدت دار'] + ['سپرده های قرض الحسنه و پس اندار و مشابه'] + ['سپرده های دیداری'])/(select ['سایر سپرده ها'] + ['سپرده های سرمایه گذاری مدت دار'] + ['سپرده های قرض الحسنه و پس اندار و مشابه'] + ['سپرده های دیداری'] from ctesumFaraBourse) else 0 end
[درصد هر بانک از چهارسپرده]
,

(['تسهیلات مالی دریافتی بلند مدت'] + ['حصه جاری تسهیلات مالی دریافتی'])/*bedehi be bank*/ + ['پرداختنی‌های تجاری و سایر پرداختنی‌ها'] /*bedehi be bazar*/[بدهی به بانک و بازار]
,
case when GroupName = N'بانک' then ['بدهی به بانکها و موسسات اعتباری']/(select ['بدهی به بانکها و موسسات اعتباری'] from ctesumFaraBourse where groupname = N'بانک') else 0 end 
[درصد بدهی هر بانک به سایر بانک ها],
['تسهیلات مالی دریافتی بلند مدت'] + ['حصه جاری تسهیلات مالی دریافتی']
[بدهی به بانکها],


((['تسهیلات مالی دریافتی بلند مدت'] + ['حصه جاری تسهیلات مالی دریافتی'])/(select ['تسهیلات مالی دریافتی بلند مدت'] + ['حصه جاری تسهیلات مالی دریافتی'] from ctesumFaraBourse))
[درصد بدهی هر شرکت به بانک از کل شرکت ها],
((['سود سهام پیشنهادی و پرداختنی'])/(select ['سود سهام پیشنهادی و پرداختنی'] from ctesumFaraBourse))
[درصد هر شرکت از کل سود پیشنهادی و پرداختی],
case when [فروش تعدیل شده یک ساله] != 0 then ['جمع داراییهای جاری'] / [فروش تعدیل شده یک ساله] else 0 end
[نسبت دارایی جاری به فروش تعدیل شده یکساله],


case when [فروش تعدیل شده یک ساله] != 0 then 
(['تسهیلات مالی دریافتی بلند مدت'] + ['حصه جاری تسهیلات مالی دریافتی']) / [فروش تعدیل شده یک ساله] else 0 end
[نسبت بدهی به بانک به فروش],
case when [خالص داریی جاری] != 0 then [ارزش بازار]/[خالص داریی جاری] else 0 end
[ارزش بازار چند برابر خالص دارایی جاری],
case when [خالص داریی جاری]  != 0 then cast(([سود خالص تعدیل شده یک ساله] * 100 )/[خالص داریی جاری] as decimal(10,1)) else 0 end  [سود خالص به خالص دارایی جاری],

['سهم گروه از سود شرکت های وابسته و مشارکت های خاص'], ['سپرده های مشتریان'] ,['جمع بدهیها و حقوق صاحبان سهام'] ,
['جمع بدهیهای جاری و غیر جاری']
, ['جمع حقوق صاحبان سهام']
, ['ذخیره مزایای پایان خدمت']
, ['ذخایر و سایر بدهی ها']
, ['سود (زیان) عملیات در حال تداوم قبل از مالیات']
, ['سود (زیان) پایه هر سهم ناشی از عملیات در حال تداوم - عملیاتی']
, ['سود (زیان) پایه هر سهم ناشی از عملیات در حال تداوم']
, ['بدهی بابت بیمه عمر و مدیریت سرمایه']
, ['مطالبات از بیمه گران و بیمه‌گران اتکایی']
, ['مطالبات از بیمه‌گذاران و نمایندگان']
, ['سهم بیمه گران اتکایی از ذخایر فنی']
, ['بدهی به بیمه‌گذاران و نمایندگان']
, ['بدهی به بیمه‌گران و بیمه‌گران اتکایی']
, ['ذخیره خسارت معوق ']
, ['سایر ذخایر فنی']
, ['ذخیره ریسک‌های منقضی نشده']
, ['سود (زیان) خالص']
, ['داراییهای نامشهود']
from [VPreBalanceSheetTalfighi_FaraBourse] 
	union all 
	select [InstrumentId], [symbolFA], [day], [سال مالی], [ماه مالی], [روز آخر دوره], [روز آخر سال مالی], [تاریخ انتشار], ['فروش'], ['بهای تمام شده کالای فروش رفته'], ['سود (زیان) خالص عملیات در حال تداوم قبل از مالیات'], ['موجودی نقد'], ['سرمایه گذاری کوتاه مدت'], ['سایر حسابها و اسناد دریافتنی'], ['موجودی مواد و کالا'], ['پیش پرداخت ها'], ['دارایی های نگهداری شده برای فروش'], ['جمع داراییهای جاری'], ['سرمایه گذاریهای بلند مدت'], ['داراییهای ثابت مشهود'], ['حسابها و اسناد دریافتنی تجاری بلند مدت'], ['سایر دارایی ها'], ['جمع داراییهای غیرجاری'], ['جمع داراییها'], ['پیش دریافتها'], ['ذخیره مالیات بر درامد'], ['سود سهام پیشنهادی و پرداختنی'], ['حصه جاری تسهیلات مالی دریافتی'], ['جمع بدهیهای جاری'], ['حسابها و اسناد پرداختنی بلند مدت'], ['تسهیلات مالی دریافتی بلند مدت'], ['سود (زیان) انباشته'], ['دریافتنی‌های تجاری و سایر دریافتنی‌ها'], ['پرداختنی‌های تجاری و سایر پرداختنی‌ها'], ['سرمایه گذاری در املاک'], ['ذخایر'], ['مطالبات از سایر بانکها و موسسات اعتباری'], ['مطالبات از بانک مرکزی'], ['سپرده های دیداری'], ['سپرده های قرض الحسنه و پس اندار و مشابه'], ['بدهی به بانک مرکزی'], ['سایر سپرده ها'], ['بدهی به بانکها و موسسات اعتباری'], ['مطالبات از دولت'], ['تسهیلات اعطایی و مطالبات از اشخاص دولتی'], ['تسهیلات اعطایی به سایر اشخاص'], ['سپرده های سرمایه گذاری مدت دار'], ['حسابها و اسناد دریافتنی تجاری'], ['حسابها و اسناد پرداختنی تجاری'], ['سایر حسابها و اسناد پرداختنی'], ['سپرده قانونی'], ['اندوخته صرف سهام'], ['پیش پرداخت های سرمایه ای'], ['بدهی‌های مرتبط با دارایی‌های غیر جاری نگهداری شده برای فروش'], [CreateDate], [سود خالص تعدیل شده یک ساله], [فروش تعدیل شده یک ساله], [بهای تمام شده تعدیل شده یک ساله], [نسبت بدهی جاری به دارایی جاری], [خالص داریی جاری], ['سرمایه گذاری در اوراق بهادار'], ['سایر دریافتنی‌ها و پیش‌پرداخت‌ها'], ['سایر سرمایه گذاری ها'], ['تسهیلات اعطایی به اشخاص'], ['سرمایه‌گذاری‌ در اوراق بهادار وسپرده های بانکی'], 
	case when [فروش تعدیل شده یک ساله] != 0 then cast(( ['جمع بدهیهای جاری'] /([فروش تعدیل شده یک ساله])) as decimal(30,2)) else 0 end  [نسبت بدهی به فروش], 
	case when [فروش تعدیل شده یک ساله] != 0 then cast([سود خالص تعدیل شده یک ساله] / ([فروش تعدیل شده یک ساله]) as decimal(30,10))else 0 end[نسبت سود به فروش], 
	cast (case when [فروش تعدیل شده یک ساله] = 0 then 0 else  [بهای تمام شده تعدیل شده یک ساله] / [فروش تعدیل شده یک ساله] end as decimal(30,2)) [بهای تمام شده کالا به فروش], 
	[بدهی به بازار],
	cast(case when [فروش تعدیل شده یک ساله] = 0 then 0 else ['موجودی مواد و کالا'] / [فروش تعدیل شده یک ساله] end as decimal(30,2)) 
	[نسبت موجودی مواد و کالا به فروش],
	[سود خالص تعدیل شده یک ساله] / (select ctesumBourse.[سود خالص تعدیل شده یک ساله] from ctesumBourse)[درصد سود هر شرکت از کل سود شرکت ها],
	cast(['داراییهای ثابت مشهود'] / (select ctesumBourse.['داراییهای ثابت مشهود'] from ctesumBourse)as decimal(30,7))[سهم هر شرکت از کل دارایی ثابت شرکت ها],
	cast([فروش تعدیل شده یک ساله] / (select ctesumBourse.[فروش تعدیل شده یک ساله] from ctesumBourse)as decimal(30,7)) [نسبت فروش هر شرکت از کل فروش شرکت ها],
	cast(['موجودی نقد'] / (select ctesumBourse.['موجودی نقد'] from ctesumBourse)as decimal(30,7)) [سهم هر شرکت از کل وجوه نقد و موجودی نزد بانک ها],



	cast([سود خالص تعدیل شده یک ساله]/ (select [سود خالص تعدیل شده یک ساله] from ctesumBourse)as decimal(30,7)) [درصد سود خالص هر شرکت از کل سود خالص شرکت ها],
cast([فروش تعدیل شده یک ساله]/ (select [فروش تعدیل شده یک ساله] from ctesumBourse)as decimal(30,7)) [درصد فروش هر شرکت از کل فروش شرکت ها],
cast([خالص داریی جاری]/ (select [خالص داریی جاری] from ctesumBourse)as decimal(30,7)) [درصد خالص دارایی هر شرکت از کل دارایی شرکت ها],
	[GroupName],
	cast(case when [خالص داریی جاری] != 0 then [فروش تعدیل شده یک ساله]/[خالص داریی جاری] else 0 end as decimal(30,12)) [فروش چند برابر خالص دارایی جاریست],

	cast(case when [ارزش بازار] != 0 then [فروش تعدیل شده یک ساله] / [ارزش بازار] else 0 end as decimal(30,12)) [نسبت فروش به ارزش بازار],
cast(case when [ارزش بازار] != 0 then [سود خالص تعدیل شده یک ساله] / [ارزش بازار] else 0 end as decimal(30,4)) [سود خالص به ارزش بازار],

		cast(case when [سود خالص تعدیل شده یک ساله]!= 0 then [ارزش بازار]  / [سود خالص تعدیل شده یک ساله] else 0 end as decimal(30,0)) [دوران بازگشت سرمایه],
cast(case when [فروش تعدیل شده یک ساله] != 0 then ['جمع بدهیهای جاری']/[فروش تعدیل شده یک ساله] else 0 end as decimal(30,5))[نسبت بدهی به فروش تعدیل شده یک ساله],
	
	cast((['سرمایه گذاری در املاک'] + ['سرمایه گذاری کوتاه مدت'] + ['سرمایه گذاریهای بلند مدت'])/(select (['سرمایه گذاری در املاک'] + ['سرمایه گذاری کوتاه مدت'] + ['سرمایه گذاریهای بلند مدت']) from ctesumBourse) as decimal(30,7))
[سهم هر شرکت از کل هر سرمایه گذاری و سایر دارایی],
 cast(case when ['جمع بدهیهای جاری'] != 0 then ['موجودی مواد و کالا']/['جمع بدهیهای جاری'] else 0 end as decimal(30,6))[نسبت موجودی مواد و کالا به بدهی],
	
		cast(case when [فروش تعدیل شده یک ساله] != 0 then ['جمع داراییهای جاری']/[فروش تعدیل شده یک ساله] else 0 end as decimal(30,6)) [نسبت دارایی جاری به فروش]
  ,cast(case when [فروش تعدیل شده یک ساله] != 0 then [خالص داریی جاری]/[فروش تعدیل شده یک ساله] else 0 end as decimal(30,6)) [خالص دارایی جاری به فروش]
  ,
  (case when [فروش تعدیل شده یک ساله] != 0 then ['پیش دریافتها']/[فروش تعدیل شده یک ساله] else 0 end ) [نسبت پیش دریافت به فروش]
,
case when GroupName = N'صنایع انرژی محور' then [سود خالص تعدیل شده یک ساله]/(select [سود خالص تعدیل شده یک ساله] from ctesumBourse) else 0 end [درصد شرکت انرژی محور چند درصد از کل سود خالص], 


case when GroupName = N'معادن' then [سود خالص تعدیل شده یک ساله]/(select [سود خالص تعدیل شده یک ساله] from ctesumBourse) else 0 end [درصد معادن چند درصد از کل سود خالص],
[ارزش بازار]
,case when [سود خالص تعدیل شده یک ساله] != 0 then ['سود سهام پیشنهادی و پرداختنی']/[سود خالص تعدیل شده یک ساله] else 0 end [نسبت سود تقسیمی به سود تعدیل شده یک ساله]
 
, (['تسهیلات مالی دریافتی بلند مدت'] + ['حصه جاری تسهیلات مالی دریافتی'])/(select ['تسهیلات مالی دریافتی بلند مدت'] + ['حصه جاری تسهیلات مالی دریافتی'] from ctesumBourse)	 [نسبت بدهی هر شرکت به بانک به کل بدهی شرکت ها به بانک]
,
['سایر سپرده ها'] + ['سپرده های سرمایه گذاری مدت دار'] + ['سپرده های قرض الحسنه و پس اندار و مشابه'] + ['سپرده های دیداری']
[چهار سپرده],
 CASE WHEN [سود خالص تعدیل شده یک ساله] != 0 THEN ['سود سهام پیشنهادی و پرداختنی']/ [سود خالص تعدیل شده یک ساله]
 ELSE 0 END
[نسبت سود تقسیمی به سود تعدیل شده یکساله],
CASE WHEN [فروش تعدیل شده یک ساله] != 0 THEN ['دریافتنی‌های تجاری و سایر دریافتنی‌ها']/[فروش تعدیل شده یک ساله]
ELSE 0 END 
[طلب از بازار به فروش],

case when GroupName = N'بانک' then( ['سایر سپرده ها'] + ['سپرده های سرمایه گذاری مدت دار'] + ['سپرده های قرض الحسنه و پس اندار و مشابه'] + ['سپرده های دیداری'])/(select ['سایر سپرده ها'] + ['سپرده های سرمایه گذاری مدت دار'] + ['سپرده های قرض الحسنه و پس اندار و مشابه'] + ['سپرده های دیداری'] from ctesumFaraBourse) else 0 end
[درصد هر بانک از چهارسپرده]
,

(['تسهیلات مالی دریافتی بلند مدت'] + ['حصه جاری تسهیلات مالی دریافتی'])/*bedehi be bank*/ + ['پرداختنی‌های تجاری و سایر پرداختنی‌ها'] /*bedehi be bazar*/[بدهی به بانک و بازار]
,
case when GroupName = N'بانک' then ['بدهی به بانکها و موسسات اعتباری']/(select ['بدهی به بانکها و موسسات اعتباری'] from ctesumBourse where groupname = N'بانک') else 0 end 
[درصد بدهی هر بانک به سایر بانک ها],
['تسهیلات مالی دریافتی بلند مدت'] + ['حصه جاری تسهیلات مالی دریافتی']
[بدهی به بانکها],

((['تسهیلات مالی دریافتی بلند مدت'] + ['حصه جاری تسهیلات مالی دریافتی'])/(select ['تسهیلات مالی دریافتی بلند مدت'] + ['حصه جاری تسهیلات مالی دریافتی'] from ctesumBourse))
[درصد بدهی هر شرکت به بانک از کل شرکت ها],
((['سود سهام پیشنهادی و پرداختنی'])/(select ['سود سهام پیشنهادی و پرداختنی'] from ctesumBourse))
[درصد هر شرکت از کل سود پیشنهادی و پرداختی],
case when [فروش تعدیل شده یک ساله] != 0 then ['جمع داراییهای جاری'] / [فروش تعدیل شده یک ساله] else 0 end
[نسبت دارایی جاری به فروش تعدیل شده یکساله],


case when [فروش تعدیل شده یک ساله] != 0 then 
(['تسهیلات مالی دریافتی بلند مدت'] + ['حصه جاری تسهیلات مالی دریافتی']) / [فروش تعدیل شده یک ساله] else 0 end
[نسبت بدهی به بانک به فروش],
case when [خالص داریی جاری] != 0 then [ارزش بازار]/[خالص داریی جاری] else 0 end
[ارزش بازار چند برابر خالص دارایی جاری],
case when [خالص داریی جاری]  != 0 then cast(([سود خالص تعدیل شده یک ساله] * 100 )/[خالص داریی جاری] as decimal(10,1)) else 0 end  [سود خالص به خالص دارایی جاری],

['سهم گروه از سود شرکت های وابسته و مشارکت های خاص'] , ['سپرده های مشتریان'],['جمع بدهیها و حقوق صاحبان سهام'],
['جمع بدهیهای جاری و غیر جاری']
, ['جمع حقوق صاحبان سهام']
, ['ذخیره مزایای پایان خدمت']
, ['ذخایر و سایر بدهی ها']
, ['سود (زیان) عملیات در حال تداوم قبل از مالیات']
, ['سود (زیان) پایه هر سهم ناشی از عملیات در حال تداوم - عملیاتی']
, ['سود (زیان) پایه هر سهم ناشی از عملیات در حال تداوم']
, ['بدهی بابت بیمه عمر و مدیریت سرمایه']
, ['مطالبات از بیمه گران و بیمه‌گران اتکایی']
, ['مطالبات از بیمه‌گذاران و نمایندگان']
, ['سهم بیمه گران اتکایی از ذخایر فنی']
, ['بدهی به بیمه‌گذاران و نمایندگان']
, ['بدهی به بیمه‌گران و بیمه‌گران اتکایی']
, ['ذخیره خسارت معوق ']
, ['سایر ذخایر فنی']
, ['ذخیره ریسک‌های منقضی نشده']
, ['سود (زیان) خالص']
, ['داراییهای نامشهود']
from [VPreBalanceSheetTalfighi_Bourse]
